  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/add-vms` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/20380a17-7835-47ef-9dd0-b7a055a70a47/terraform-bin plan -no-color -compact-warnings
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_subnet.k8s-subnet will be created
+ resource "azurerm_subnet" "k8s-subnet" {
    + address_prefixes                               = [
        + "10.0.0.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "k8s-subnet"
    + resource_group_name                            = "k8s"
    + virtual_network_name                           = "k8s-vnet"
  }

# azurerm_virtual_network.k8s-vnet will be created
+ resource "azurerm_virtual_network" "k8s-vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "westus2"
    + name                = "k8s-vnet"
    + resource_group_name = "k8s"
    + subnet              = (known after apply)
  }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>